# Pandas week 4

# 13. Konversi nilai numerik ke dalam kategori pada Data Frame

In [33]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [34]:
#Data Frame Prep
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99, size=(n_rows, n_cols)),
                 columns=cols)

df

   usia
0     8
1    17
2    82
3    75
4    89
5    11
6    40
7    18
8    93
9    25

# Pengelompokan nilai numerik ke dalam bebearap kategori menggunakan cut()

In [35]:
df['Kelompok usia'] = pd.cut(df['usia'],
                            bins= [0,18,65,99],
                            labels=['anak', 'dewasa', 'manula'])
#anak: 0-18
#dewasa: 18-65
#manula: 65-99
df

   usia Kelompok usia
0     8          anak
1    17          anak
2    82        manula
3    75        manula
4    89        manula
5    11          anak
6    40        dewasa
7    18          anak
8    93        manula
9    25        dewasa

# 14. Menggabungkan (merge) dua Data Frame

In [36]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

Data Frame Prep

In [37]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

kf = pd.DataFrame(np.random.randint(1,20, size=(n_rows, n_cols)),
                 columns=cols)

kf.head()

    A   B   C   D   E
0   2  17   8  16  16
1  11  12  18   6  10
2  10   5   9  15  14
3  15   5  12   4  10
4  16   9  10  18   5

In [38]:
kf1= kf.copy(deep = True)
kf1= kf1.drop([1,4])
#drop unutk membuang index yang kita mau
kf1

    A   B   C   D   E
0   2  17   8  16  16
2  10   5   9  15  14
3  15   5  12   4  10

In [39]:
kf2= kf.copy(deep = True)
kf2= kf2.drop([0,4])
kf2

    A   B   C   D   E
1  11  12  18   6  10
2  10   5   9  15  14
3  15   5  12   4  10

# Menggabungkan dua Data Frame

In [40]:
kf_inner=pd.merge(kf1,kf2, how='inner')
#inner: menggabungkan dua data Frame dimana data frame yang baru akan berisi baris yang terdapat pada kedua data frame sumbernya
kf_inner

    A  B   C   D   E
0  10  5   9  15  14
1  15  5  12   4  10

In [41]:
kf_outer=pd.merge(kf1,kf2, how='outer')
#outer: menggabungkan dua data Frame dimana data frame yang baru akan berisi baris yang terdapat pada semua data frame sumbernya dan menghilangkan duplikatnya (bila ada)
kf_outer

    A   B   C   D   E
0   2  17   8  16  16
1  10   5   9  15  14
2  15   5  12   4  10
3  11  12  18   6  10

# 15. Memecah nilai string suatu kolom ke dalam beberapa kolom baru

In [42]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [43]:
#Data Frame Prep
data = {'nama':['Ryan Reindhardt', 'Robert Allen','Joseph Lucas'],
        'tempat_kelahiran':['Bandung, Jawa Barat', 'Jakarta, DKI Jakarta', 'Mojoker, Jawa Timur']}

nf= pd.DataFrame(data)

nf

              nama      tempat_kelahiran
0  Ryan Reindhardt   Bandung, Jawa Barat
1     Robert Allen  Jakarta, DKI Jakarta
2     Joseph Lucas   Mojoker, Jawa Timur

# Memecah nama depan dan nama belakang

In [44]:
nf[['nama_depan','nama_belakang']]= nf['nama'].str.split(' ',expand=True)
#nama dipecah atau displit berdasarkan spasi(paramter pertama)
#parameter tambahan (expand=True) berarti kita menginjinkan outputnya berupa kolom
nf

              nama      tempat_kelahiran nama_depan nama_belakang
0  Ryan Reindhardt   Bandung, Jawa Barat       Ryan    Reindhardt
1     Robert Allen  Jakarta, DKI Jakarta     Robert         Allen
2     Joseph Lucas   Mojoker, Jawa Timur     Joseph         Lucas

# Memecah nama kota dan nama propinsi

In [45]:
nf[['kota','propinsi']]= nf['tempat_kelahiran'].str.split(',',expand=True)
#tempat_kelahiran dipecah atau displit berdasarkan tanda koma(,)(paramter pertama)
nf

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Ryan Reindhardt,"Bandung, Jawa Barat",Ryan,Reindhardt,Bandung,Jawa Barat
1,Robert Allen,"Jakarta, DKI Jakarta",Robert,Allen,Jakarta,DKI Jakarta
2,Joseph Lucas,"Mojoker, Jawa Timur",Joseph,Lucas,Mojoker,Jawa Timur

# 16. Menata ulang Data Frame dengan multiple indexes menggunakan unstack()

In [46]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [47]:
#Data Frame Prep
uf = pd.read_csv('C:/Users/Markvinson/Visualisasi data/Pandas/datasets/titanicfull.csv')
uf.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Data Frame dengan multiple indexes dari hasil groupping

In [48]:
uf.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

# Menata ulang Data Frame dengan multiple indexes

In [50]:
uf.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

source: https://www.youtube.com/playlist?list=PL2O3HdJI4voGdD_9xhVCTBoDTDNHpajm5 Trs_M